app/views/messages/_message.html.erb

<div>(<%= message.created_at.strftime("%I: %M") %>)<b><%= message.user.name %></b>: <%= message.content %> <div>
---
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "fee"], ["user_id", 1], ["created_at", "2015-07-25 12:29:45.413799"], ["updated_at", "2015-07-25 12:29:45.413799"]]