app/controllers/messages_controller.rb

  def index
    @messages = Message.all.last(100)
---
SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 100

  def create
    if session[:user_id]
      @message = Message.new(message_params)
      @message.update(user_id: session[:user_id])
      @message.save
      @messages = Message.all.last(100)
---
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "whats up"], ["user_id", 1], ["created_at", "2015-07-25 12:25:56.653032"], ["updated_at", "2015-07-25 12:25:56.653032"]]
SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 100