app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "ant"]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ant"], ["password_digest", "$2a$10$Rz6y/nQ1iA0m/jhiSYKLWOpTPT1P.TpCA7z.4eo1C9knT7Ku1T0ce"], ["created_at", "2015-07-25 12:21:48.631515"], ["updated_at", "2015-07-25 12:21:48.631515"]]
---
  def create
    if @user.find_by(params[:user][:username])
      session[:user_id] = @user.id
    else
      @user = User.create(user_params)